yt11dev.СК/src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

yt11dev.СК/src/Documents/СК_СписаниеСклад/СК_СписаниеСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СК_СписаниеСклад</name>
  <registerRecords>AccumulationRegister.СК_ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>ДокументОснования</name>
    <type>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВнутреннееПотребление</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСборки</name>
    <type>
      <types>EnumRef.СК_СтатусСборкиРеализации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Собран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СобранныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СК_Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНабора</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

yt11dev.СК/src/DataProcessors/СК_МобСклад/Forms/ФормаРеализации/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	Если СтруктураПараметров.Ссылка <> "" Тогда 
		ЗаполнитьТабТовары(СтруктураПараметров.Ссылка);
	Иначе
		Сообщить("Не удалось создать документ отгрузки");	
	КонецЕсли;
	

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТабТовары(Док)
	
	ТабТовары.Очистить();
	
	СКСписание = НайтиДокСписания(Док);
	
	Если СКСписание.Пустая() = Истина Тогда
		НовыйДок = Документы.СК_СписаниеСклад.СоздатьДокумент();  
		НовыйДок.Дата = ТекущаяДата();
		НовыйДок.ДокументОснования = Док;
		НовыйДок.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран;
	Иначе
		НовыйДок = СКСписание.ПолучитьОбъект();
	КонецЕсли;
	
	ВТЧ = Док.Товары.Выгрузить();
	НовыйДок.Товары.Загрузить(ВТЧ); 
	
	Попытка
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение); 
		Д = НовыйДок;
		ЭтаФорма.ДокОсн = Д.Ссылка;
	Исключение
		Сообщить("Не удалось создать документ отгрузки");	
	КонецПопытки;
	
	ОбновитьТабТовары();
	
КонецПроцедуры


&НаСервере
Функция НайтиДокСписания(Док)	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_СписаниеСклад.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СК_СписаниеСклад КАК СК_СписаниеСклад
	               |ГДЕ
	               |	СК_СписаниеСклад.ПометкаУдаления = &ПометкаУдаления
	               |	И СК_СписаниеСклад.Проведен = &Проведен
	               |	И СК_СписаниеСклад.ДокументОснования = &ДокументОснования";
	
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("ДокументОснования",Док);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Документы.СК_СписаниеСклад.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбновитьТабТовары()
	
	ТабТовары.Очистить();
	
	ВТЧТовары = ЭтаФорма.ДокОсн.Товары.Выгрузить();
	ВТЧСобрано = ЭтаФорма.ДокОсн.СобранныеТовары.Выгрузить();
	ВТЧСобрано.Свернуть("Номенклатура","Количество");
	ТабТовары.Загрузить(ВТЧТовары);
	
	Для Каждого стр из ТабТовары Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",стр.Номенклатура);
		Строки = ВТЧСобрано.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда
			стр.КоличествоСобрано = Строки[0].Количество; 
		КонецЕсли;
	КонецЦикла; 
	//
	Отбор = Новый Структура;
	Отбор.Вставить("Собран",Ложь);
	
	ПСтроки = ТабТовары.НайтиСтроки(Отбор);
	Если ПСтроки.Количество() = 0 Тогда  
		Док = ДокОсн.ПолучитьОбъект();
		Если Док.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.НеСобран Тогда 
			ДокУчет = Док.ДокументОснования.ПолучитьОбъект();
			ДокУчет.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран;
			Док.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран;
			Док.Записать(РежимЗаписиДокумента.Проведение); 
			ДокУчет.Записать(РежимЗаписиДокумента.Проведение); 
		КонецЕсли;
		Если Док.СтатусСборки = Перечисления.СК_СтатусСборкиРеализации.Собран Тогда 
	    	ЭтаФорма.Элементы.ГруппаТоваров.Доступность = Ложь;
		КонецЕсли;
		
		ЭтаФорма.Элементы.Собран.Заголовок = "Документ собран";
	КонецЕсли;
	ТабТовары.Сортировать("Собран ВОЗР");
КонецПроцедуры

&НаКлиенте
Процедура ТабТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыФормыОстатки = Новый Структура;     
	ПараметрыФормыОстатки.Вставить("Ссылка",ДокОсн);
	ПараметрыФормыОстатки.Вставить("Номенклатура",Элемент.ТекущиеДанные.Номенклатура);
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.СК_МобСклад.Форма.ФормаСборкиЗаказа", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры    

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
ОбновитьТабТовары();	
КонецПроцедуры
